7767517
197 224
Input            images                   0 1 images
Split            splitncnn_input0         1 4 images images_splitncnn_0 images_splitncnn_1 images_splitncnn_2 images_splitncnn_3
Interp           Resize_28                1 1 images_splitncnn_3 195 0=1 1=1.000000e+00 2=1.000000e+00 3=320 4=320 6=0
Interp           Resize_57                1 1 images_splitncnn_2 224 0=1 1=1.000000e+00 2=1.000000e+00 3=320 4=320 6=0
Interp           Resize_86                1 1 images_splitncnn_1 253 0=1 1=1.000000e+00 2=1.000000e+00 3=320 4=320 6=0
Interp           Resize_115               1 1 images_splitncnn_0 282 0=1 1=1.000000e+00 2=1.000000e+00 3=320 4=320 6=0
Concat           Concat_116               4 1 195 224 253 282 283 0=0
Convolution      Conv_117                 1 1 283 284 0=32 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=3456
HardSwish        Div_125                  1 1 284 292 0=1.666667e-01 1=5.000000e-01
Convolution      Conv_126                 1 1 292 293 0=64 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=18432
HardSwish        Div_134                  1 1 293 301 0=1.666667e-01 1=5.000000e-01
Split            splitncnn_0              1 2 301 301_splitncnn_0 301_splitncnn_1
Convolution      Conv_135                 1 1 301_splitncnn_1 302 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2048
HardSwish        Div_143                  1 1 302 310 0=1.666667e-01 1=5.000000e-01
Split            splitncnn_1              1 2 310 310_splitncnn_0 310_splitncnn_1
Convolution      Conv_144                 1 1 310_splitncnn_1 311 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1024
HardSwish        Div_152                  1 1 311 319 0=1.666667e-01 1=5.000000e-01
Convolution      Conv_153                 1 1 319 320 0=32 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=9216
HardSwish        Div_161                  1 1 320 328 0=1.666667e-01 1=5.000000e-01
BinaryOp         Add_162                  2 1 310_splitncnn_0 328 329 0=0
Convolution      Conv_163                 1 1 329 330 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=1024
Convolution      Conv_164                 1 1 301_splitncnn_0 331 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=2048
Concat           Concat_165               2 1 330 331 332 0=0
BatchNorm        BatchNormalization_166   1 1 332 333 0=64
ReLU             LeakyRelu_167            1 1 333 334 0=1.000000e-01
Convolution      Conv_168                 1 1 334 335 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4096
HardSwish        Div_176                  1 1 335 343 0=1.666667e-01 1=5.000000e-01
Convolution      Conv_177                 1 1 343 344 0=128 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=73728
HardSwish        Div_185                  1 1 344 352 0=1.666667e-01 1=5.000000e-01
Split            splitncnn_2              1 2 352 352_splitncnn_0 352_splitncnn_1
Convolution      Conv_186                 1 1 352_splitncnn_1 353 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=8192
HardSwish        Div_194                  1 1 353 361 0=1.666667e-01 1=5.000000e-01
Split            splitncnn_3              1 2 361 361_splitncnn_0 361_splitncnn_1
Convolution      Conv_195                 1 1 361_splitncnn_1 362 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4096
HardSwish        Div_203                  1 1 362 370 0=1.666667e-01 1=5.000000e-01
Convolution      Conv_204                 1 1 370 371 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=36864
HardSwish        Div_212                  1 1 371 379 0=1.666667e-01 1=5.000000e-01
BinaryOp         Add_213                  2 1 361_splitncnn_0 379 380 0=0
Split            splitncnn_4              1 2 380 380_splitncnn_0 380_splitncnn_1
Convolution      Conv_214                 1 1 380_splitncnn_1 381 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4096
HardSwish        Div_222                  1 1 381 389 0=1.666667e-01 1=5.000000e-01
Convolution      Conv_223                 1 1 389 390 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=36864
HardSwish        Div_231                  1 1 390 398 0=1.666667e-01 1=5.000000e-01
BinaryOp         Add_232                  2 1 380_splitncnn_0 398 399 0=0
Split            splitncnn_5              1 2 399 399_splitncnn_0 399_splitncnn_1
Convolution      Conv_233                 1 1 399_splitncnn_1 400 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4096
HardSwish        Div_241                  1 1 400 408 0=1.666667e-01 1=5.000000e-01
Convolution      Conv_242                 1 1 408 409 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=36864
HardSwish        Div_250                  1 1 409 417 0=1.666667e-01 1=5.000000e-01
BinaryOp         Add_251                  2 1 399_splitncnn_0 417 418 0=0
Convolution      Conv_252                 1 1 418 419 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=4096
Convolution      Conv_253                 1 1 352_splitncnn_0 420 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=8192
Concat           Concat_254               2 1 419 420 421 0=0
BatchNorm        BatchNormalization_255   1 1 421 422 0=128
ReLU             LeakyRelu_256            1 1 422 423 0=1.000000e-01
Convolution      Conv_257                 1 1 423 424 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=16384
HardSwish        Div_265                  1 1 424 432 0=1.666667e-01 1=5.000000e-01
Split            splitncnn_6              1 2 432 432_splitncnn_0 432_splitncnn_1
Convolution      Conv_266                 1 1 432_splitncnn_1 433 0=256 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=294912
HardSwish        Div_274                  1 1 433 441 0=1.666667e-01 1=5.000000e-01
Split            splitncnn_7              1 2 441 441_splitncnn_0 441_splitncnn_1
Convolution      Conv_275                 1 1 441_splitncnn_1 442 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=32768
HardSwish        Div_283                  1 1 442 450 0=1.666667e-01 1=5.000000e-01
Split            splitncnn_8              1 2 450 450_splitncnn_0 450_splitncnn_1
Convolution      Conv_284                 1 1 450_splitncnn_1 451 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=16384
HardSwish        Div_292                  1 1 451 459 0=1.666667e-01 1=5.000000e-01
Convolution      Conv_293                 1 1 459 460 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=147456
HardSwish        Div_301                  1 1 460 468 0=1.666667e-01 1=5.000000e-01
BinaryOp         Add_302                  2 1 450_splitncnn_0 468 469 0=0
Split            splitncnn_9              1 2 469 469_splitncnn_0 469_splitncnn_1
Convolution      Conv_303                 1 1 469_splitncnn_1 470 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=16384
HardSwish        Div_311                  1 1 470 478 0=1.666667e-01 1=5.000000e-01
Convolution      Conv_312                 1 1 478 479 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=147456
HardSwish        Div_320                  1 1 479 487 0=1.666667e-01 1=5.000000e-01
BinaryOp         Add_321                  2 1 469_splitncnn_0 487 488 0=0
Split            splitncnn_10             1 2 488 488_splitncnn_0 488_splitncnn_1
Convolution      Conv_322                 1 1 488_splitncnn_1 489 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=16384
HardSwish        Div_330                  1 1 489 497 0=1.666667e-01 1=5.000000e-01
Convolution      Conv_331                 1 1 497 498 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=147456
HardSwish        Div_339                  1 1 498 506 0=1.666667e-01 1=5.000000e-01
BinaryOp         Add_340                  2 1 488_splitncnn_0 506 507 0=0
Convolution      Conv_341                 1 1 507 508 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=16384
Convolution      Conv_342                 1 1 441_splitncnn_0 509 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=32768
Concat           Concat_343               2 1 508 509 510 0=0
BatchNorm        BatchNormalization_344   1 1 510 511 0=256
ReLU             LeakyRelu_345            1 1 511 512 0=1.000000e-01
Convolution      Conv_346                 1 1 512 513 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=65536
HardSwish        Div_354                  1 1 513 521 0=1.666667e-01 1=5.000000e-01
Split            splitncnn_11             1 2 521 521_splitncnn_0 521_splitncnn_1
Convolution      Conv_355                 1 1 521_splitncnn_1 522 0=512 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=1179648
HardSwish        Div_363                  1 1 522 530 0=1.666667e-01 1=5.000000e-01
Convolution      Conv_364                 1 1 530 531 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=131072
HardSwish        Div_372                  1 1 531 539 0=1.666667e-01 1=5.000000e-01
Split            splitncnn_12             1 4 539 539_splitncnn_0 539_splitncnn_1 539_splitncnn_2 539_splitncnn_3
Pooling          MaxPool_373              1 1 539_splitncnn_3 540 0=0 1=5 11=5 2=1 12=1 3=2 13=2 14=2 15=2 5=1
Pooling          MaxPool_374              1 1 539_splitncnn_2 541 0=0 1=9 11=9 2=1 12=1 3=4 13=4 14=4 15=4 5=1
Pooling          MaxPool_375              1 1 539_splitncnn_1 542 0=0 1=13 11=13 2=1 12=1 3=6 13=6 14=6 15=6 5=1
Concat           Concat_376               4 1 539_splitncnn_0 540 541 542 543 0=0
Convolution      Conv_377                 1 1 543 544 0=512 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=524288
HardSwish        Div_385                  1 1 544 552 0=1.666667e-01 1=5.000000e-01
Split            splitncnn_13             1 2 552 552_splitncnn_0 552_splitncnn_1
Convolution      Conv_386                 1 1 552_splitncnn_1 553 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=131072
HardSwish        Div_394                  1 1 553 561 0=1.666667e-01 1=5.000000e-01
Convolution      Conv_395                 1 1 561 562 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=65536
HardSwish        Div_403                  1 1 562 570 0=1.666667e-01 1=5.000000e-01
Convolution      Conv_404                 1 1 570 571 0=256 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=589824
HardSwish        Div_412                  1 1 571 579 0=1.666667e-01 1=5.000000e-01
Convolution      Conv_413                 1 1 579 580 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=65536
Convolution      Conv_414                 1 1 552_splitncnn_0 581 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=131072
Concat           Concat_415               2 1 580 581 582 0=0
BatchNorm        BatchNormalization_416   1 1 582 583 0=512
ReLU             LeakyRelu_417            1 1 583 584 0=1.000000e-01
Convolution      Conv_418                 1 1 584 585 0=512 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=262144
HardSwish        Div_426                  1 1 585 593 0=1.666667e-01 1=5.000000e-01
Convolution      Conv_427                 1 1 593 594 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=131072
HardSwish        Div_435                  1 1 594 602 0=1.666667e-01 1=5.000000e-01
Split            splitncnn_14             1 2 602 602_splitncnn_0 602_splitncnn_1
Interp           Resize_437               1 1 602_splitncnn_1 612 0=1 1=2.000000e+00 2=2.000000e+00 3=0 4=0 6=0
Concat           Concat_438               2 1 612 521_splitncnn_0 613 0=0
Split            splitncnn_15             1 2 613 613_splitncnn_0 613_splitncnn_1
Convolution      Conv_439                 1 1 613_splitncnn_1 614 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=65536
HardSwish        Div_447                  1 1 614 622 0=1.666667e-01 1=5.000000e-01
Convolution      Conv_448                 1 1 622 623 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=16384
HardSwish        Div_456                  1 1 623 631 0=1.666667e-01 1=5.000000e-01
Convolution      Conv_457                 1 1 631 632 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=147456
HardSwish        Div_465                  1 1 632 640 0=1.666667e-01 1=5.000000e-01
Convolution      Conv_466                 1 1 640 641 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=16384
Convolution      Conv_467                 1 1 613_splitncnn_0 642 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=65536
Concat           Concat_468               2 1 641 642 643 0=0
BatchNorm        BatchNormalization_469   1 1 643 644 0=256
ReLU             LeakyRelu_470            1 1 644 645 0=1.000000e-01
Convolution      Conv_471                 1 1 645 646 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=65536
HardSwish        Div_479                  1 1 646 654 0=1.666667e-01 1=5.000000e-01
Convolution      Conv_480                 1 1 654 655 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=32768
HardSwish        Div_488                  1 1 655 663 0=1.666667e-01 1=5.000000e-01
Split            splitncnn_16             1 2 663 663_splitncnn_0 663_splitncnn_1
Interp           Resize_490               1 1 663_splitncnn_1 673 0=1 1=2.000000e+00 2=2.000000e+00 3=0 4=0 6=0
Concat           Concat_491               2 1 673 432_splitncnn_0 674 0=0
Split            splitncnn_17             1 2 674 674_splitncnn_0 674_splitncnn_1
Convolution      Conv_492                 1 1 674_splitncnn_1 675 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=16384
HardSwish        Div_500                  1 1 675 683 0=1.666667e-01 1=5.000000e-01
Convolution      Conv_501                 1 1 683 684 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4096
HardSwish        Div_509                  1 1 684 692 0=1.666667e-01 1=5.000000e-01
Convolution      Conv_510                 1 1 692 693 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=36864
HardSwish        Div_518                  1 1 693 701 0=1.666667e-01 1=5.000000e-01
Convolution      Conv_519                 1 1 701 702 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=4096
Convolution      Conv_520                 1 1 674_splitncnn_0 703 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=16384
Concat           Concat_521               2 1 702 703 704 0=0
BatchNorm        BatchNormalization_522   1 1 704 705 0=128
ReLU             LeakyRelu_523            1 1 705 706 0=1.000000e-01
Convolution      Conv_524                 1 1 706 707 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=16384
HardSwish        Div_532                  1 1 707 715 0=1.666667e-01 1=5.000000e-01
Split            splitncnn_18             1 2 715 715_splitncnn_0 715_splitncnn_1
Convolution      Conv_533                 1 1 715_splitncnn_1 716 0=128 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=147456
HardSwish        Div_541                  1 1 716 724 0=1.666667e-01 1=5.000000e-01
Concat           Concat_542               2 1 724 663_splitncnn_0 725 0=0
Split            splitncnn_19             1 2 725 725_splitncnn_0 725_splitncnn_1
Convolution      Conv_543                 1 1 725_splitncnn_1 726 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=32768
HardSwish        Div_551                  1 1 726 734 0=1.666667e-01 1=5.000000e-01
Convolution      Conv_552                 1 1 734 735 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=16384
HardSwish        Div_560                  1 1 735 743 0=1.666667e-01 1=5.000000e-01
Convolution      Conv_561                 1 1 743 744 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=147456
HardSwish        Div_569                  1 1 744 752 0=1.666667e-01 1=5.000000e-01
Convolution      Conv_570                 1 1 752 753 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=16384
Convolution      Conv_571                 1 1 725_splitncnn_0 754 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=32768
Concat           Concat_572               2 1 753 754 755 0=0
BatchNorm        BatchNormalization_573   1 1 755 756 0=256
ReLU             LeakyRelu_574            1 1 756 757 0=1.000000e-01
Convolution      Conv_575                 1 1 757 758 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=65536
HardSwish        Div_583                  1 1 758 766 0=1.666667e-01 1=5.000000e-01
Split            splitncnn_20             1 2 766 766_splitncnn_0 766_splitncnn_1
Convolution      Conv_584                 1 1 766_splitncnn_1 767 0=256 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=589824
HardSwish        Div_592                  1 1 767 775 0=1.666667e-01 1=5.000000e-01
Concat           Concat_593               2 1 775 602_splitncnn_0 776 0=0
Split            splitncnn_21             1 2 776 776_splitncnn_0 776_splitncnn_1
Convolution      Conv_594                 1 1 776_splitncnn_1 777 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=131072
HardSwish        Div_602                  1 1 777 785 0=1.666667e-01 1=5.000000e-01
Convolution      Conv_603                 1 1 785 786 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=65536
HardSwish        Div_611                  1 1 786 794 0=1.666667e-01 1=5.000000e-01
Convolution      Conv_612                 1 1 794 795 0=256 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=589824
HardSwish        Div_620                  1 1 795 803 0=1.666667e-01 1=5.000000e-01
Convolution      Conv_621                 1 1 803 804 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=65536
Convolution      Conv_622                 1 1 776_splitncnn_0 805 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=0 6=131072
Concat           Concat_623               2 1 804 805 806 0=0
BatchNorm        BatchNormalization_624   1 1 806 807 0=512
ReLU             LeakyRelu_625            1 1 807 808 0=1.000000e-01
Convolution      Conv_626                 1 1 808 809 0=512 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=262144
HardSwish        Div_634                  1 1 809 817 0=1.666667e-01 1=5.000000e-01
Convolution      Conv_635                 1 1 715_splitncnn_0 818 0=21 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2688
Reshape          Reshape_649              1 1 818 836 0=6400 1=7 2=3
Permute          Transpose_650            1 1 836 output 0=1
Convolution      Conv_651                 1 1 766_splitncnn_0 838 0=21 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=5376
Reshape          Reshape_665              1 1 838 856 0=1600 1=7 2=3
Permute          Transpose_666            1 1 856 857 0=1
Convolution      Conv_667                 1 1 817 858 0=21 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=10752
Reshape          Reshape_681              1 1 858 876 0=400 1=7 2=3
Permute          Transpose_682            1 1 876 877 0=1
